; domain
(define (domain logistics-strips)
  (:requirements
                :strips)
  (:types
            tOBJ tTRUCK tLOCATION tCITY tAIRPLANE - object
            )
  (:predicates
        (OBJ ?obj)
        (TRUCK ?truck)
        (LOCATION ?loc)
        (AIRPLANE ?airplane)
        (CITY ?city)
        (AIRPORT ?loc)
		(in ?obj ?loc)
		(in ?obj1 ?obj2)
		(inCity ?obj ?city)
		(drivesInside ?truck ?city)
		(fliesTo ?airplane ?city)
		)

;IMPORTANT in-city is swapped to inCity. "-" is used as a special character and allowed in naming. This is a mistake for a language specification.
; ALSO IMPORTANT. locFrom and locTo have been changed to locFrom and locTo. The "-" is used in other places such as object definition , as a language special character.
; this is a mistake on pddl specification on what characters should be allowed in names.
; IMPORTANT do NOT use "_" in any naming

; ==================================================================================

(:action LOAD-TRUCK
  :parameters
   (?obj - tOBJ
    ?truck - tTRUCK
    ?loc - tLOCATION
    ?city - tCity)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) (CITY ?city)
   (in ?truck ?loc) (in ?obj ?loc)
   (inCity ?loc ?city)(drivesInside ?truck ?city))
  :effect
   (and (not (in ?obj ?loc)) (in ?obj ?truck)))


(:action LOAD-AIRPLANE
  :parameters
   (
    ?obj - tOBJ
    ?airplane - tAIRPLANE
    ?loc - tLOCATION
    ?city - tCITY
    )
  :precondition
  (
   and (OBJ ?obj) (AIRPLANE ?airplane) (AIRPORT ?loc) (CITY ?city)
   (in ?obj ?loc) (in ?airplane ?loc)
   (inCity ?loc ?city)(fliesTo ?airplane ?city)
   )

  :effect

   (and (not (in ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - tOBJ
    ?truck - tTRUCK
    ?loc - tLOCATION
    ?city - tCITY)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) (CITY ?city)
    (in ?truck ?loc) (in ?obj ?truck)
    (inCity ?loc ?city)(drivesInside ?truck ?city))
  :effect
   (and (not (in ?obj ?truck)) (in ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj - tOBJ
    ?airplane - tAIRPLANE
    ?loc - tLOCATION
    ?city - tCITY)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (AIRPORT ?loc)
        (in ?obj ?airplane) (in ?airplane ?loc)
       (inCity ?loc ?city)(fliesTo ?airplane ?city) )
  :effect
   (and (not (in ?obj ?airplane)) (in ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - tTRUCK
    ?locFrom - tLOCATION
    ?locTo - tLOCATION
    ?city - tCITY )
  :precondition
   (and (TRUCK ?truck) (LOCATION ?locFrom) (LOCATION ?locTo) (CITY ?city)
   (in ?truck ?locFrom)
   (inCity ?locFrom ?city)
   (inCity ?locTo ?city)
   (drivesInside ?truck ?city))
  :effect
   (and (not (in ?truck ?locFrom)) (in ?truck ?locTo)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane - tAIRPLANE
    ?locFrom - tLOCATION
    ?locTo - tLOCATION
    ?cityFrom - tCity
    ?cityTo - tCity)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?locFrom) (AIRPORT ?locTo) (CITY ?cityFrom) (CITY ?cityTo)
   (inCity ?locFrom ?cityFrom)(inCity ?locTo ?cityTo)
	(in ?airplane ?locFrom)
	(fliesTo ?airplane ?cityFrom)
	(fliesTo ?airplane ?cityTo))
  :effect
   (and (not (in ?airplane ?locFrom)) (in ?airplane ?locTo)))


) ; END OF DOMAIN FILE

; problem
(define (problem logistics-c8-s4-p1-a4)
(:domain logistics-strips)
(:objects
          c0 c1 c2 c3 c4 c5 c6 c7 - tCITY
          a0 a1 a2 a3 - tAIRPLANE
          l00 l10 l20 l30 l40 l50 l60 l70 l01 l02 l03 l11 l12 l13 l21 l22 l23 l31 l32 l41 l42 l51 l52 l61 l62 l71 l72 l73 - tLOCATION
          p0 - tOBJ
          t0 t1 t2 t3 t4 t5 t6 t7 - tTRUCK

)
; The major modification is that the airplanes are both regular airplanes (for loading and unloading) as well as special airplanes for accessing specific
; subset of cities. This separates the cities.
; a0 a1 a2 a3 - tAIRPLANE
;IMPORTANT in-city is swapped to inCity. "-" is used as a special character and allowed in naming. This is a mistake for a language specification.
; IMPORTANT do NOT use "_" in any naming

(:init
(OBJ p0)
(CITY c0)
(CITY c1)
(CITY c2)
(CITY c3)
(CITY c4)
(CITY c5)
(CITY c6)
(CITY c7)
(AIRPLANE a0)
(AIRPLANE a1)
(AIRPLANE a2)
(AIRPLANE a3)
(AIRPORT l00)
(AIRPORT l10)
(AIRPORT l20)
(AIRPORT l30)
(AIRPORT l40)
(AIRPORT l50)
(AIRPORT l60)
(AIRPORT l70)
(TRUCK t0)
(TRUCK t1)
(TRUCK t2)
(TRUCK t3)
(TRUCK t4)
(TRUCK t5)
(TRUCK t6)
(TRUCK t7)
(drivesInside t0 c0)
(drivesInside t1 c1)
(drivesInside t2 c2)
(drivesInside t3 c3)
(drivesInside t4 c4)
(drivesInside t5 c5)
(drivesInside t6 c6)
(drivesInside t7 c7)
(LOCATION l00)
(inCity  l00 c0)
(LOCATION l01)
(inCity  l01 c0)
(LOCATION l02)
(inCity  l02 c0)
(LOCATION l03)
(inCity  l03 c0)
(LOCATION l10)
(inCity  l10 c1)
(LOCATION l11)
(inCity  l11 c1)
(LOCATION l12)
(inCity  l12 c1)
(LOCATION l13)
(inCity  l13 c1)
(LOCATION l20)
(inCity  l20 c2)
(LOCATION l21)
(inCity  l21 c2)
(LOCATION l22)
(inCity  l22 c2)
(LOCATION l23)
(inCity  l23 c2)
(LOCATION l30)
(inCity  l30 c3)
(LOCATION l31)
(inCity  l31 c3)
(LOCATION l32)
(inCity  l32 c3)
(LOCATION l33)
(inCity  l33 c3)
(LOCATION l40)
(inCity  l40 c4)
(LOCATION l41)
(inCity  l41 c4)
(LOCATION l42)
(inCity  l42 c4)
(LOCATION l43)
(inCity  l43 c4)
(LOCATION l50)
(inCity  l50 c5)
(LOCATION l51)
(inCity  l51 c5)
(LOCATION l52)
(inCity  l52 c5)
(LOCATION l53)
(inCity  l53 c5)
(LOCATION l60)
(inCity  l60 c6)
(LOCATION l61)
(inCity  l61 c6)
(LOCATION l62)
(inCity  l62 c6)
(LOCATION l63)
(inCity  l63 c6)
(LOCATION l70)
(inCity  l70 c7)
(LOCATION l71)
(inCity  l71 c7)
(LOCATION l72)
(inCity  l72 c7)
(LOCATION l73)
(inCity  l73 c7)


(fliesTo a0 c0)
(fliesTo a0 c1)
(fliesTo a0 c2)
(fliesTo a0 c3)

(fliesTo a1 c3)
(fliesTo a1 c4)

(fliesTo a2 c4)
(fliesTo a2 c5)
(fliesTo a2 c6)

(fliesTo a3 c5)
(fliesTo a3 c6)
(fliesTo a3 c7)


(in t0 l00)
(in t1 l11)
(in t2 l22)
(in t3 l31)
(in t4 l42)
(in t5 l50)
(in t6 l60)
(in t7 l70)
(in a0 l00)
(in a1 l40)
(in a2 l60)
(in a3 l70)
(in p0 l00)

)
(:goal
(and
(in p0 l72)
)
)
)

; plan
1. (load-airplane p0 a0 l00 c0)
   deleted: (in p0 l00)
   added: (in p0 a0)
   goals met: 0 of 1
2. (fly-airplane a0 l00 l30 c0 c3)
   deleted: (in a0 l00)
   added: (in a0 l30)
   goals met: 0 of 1
3. (unload-airplane p0 a0 l30 c3)
   deleted: (in p0 a0)
   added: (in p0 l30)
   goals met: 0 of 1
4. (fly-airplane a1 l40 l30 c4 c3)
   deleted: (in a1 l40)
   added: (in a1 l30)
   goals met: 0 of 1
5. (load-airplane p0 a1 l30 c3)
   deleted: (in p0 l30)
   added: (in p0 a1)
   goals met: 0 of 1
6. (fly-airplane a1 l30 l40 c3 c4)
   deleted: (in a1 l30)
   added: (in a1 l40)
   goals met: 0 of 1
7. (unload-airplane p0 a1 l40 c4)
   deleted: (in p0 a1)
   added: (in p0 l40)
   goals met: 0 of 1
8. (fly-airplane a2 l60 l40 c6 c4)
   deleted: (in a2 l60)
   added: (in a2 l40)
   goals met: 0 of 1
9. (load-airplane p0 a2 l40 c4)
   deleted: (in p0 l40)
   added: (in p0 a2)
   goals met: 0 of 1
10. (fly-airplane a2 l40 l50 c4 c5)
   deleted: (in a2 l40)
   added: (in a2 l50)
   goals met: 0 of 1
11. (unload-airplane p0 a2 l50 c5)
   deleted: (in p0 a2)
   added: (in p0 l50)
   goals met: 0 of 1
12. (fly-airplane a3 l70 l50 c7 c5)
   deleted: (in a3 l70)
   added: (in a3 l50)
   goals met: 0 of 1
13. (load-airplane p0 a3 l50 c5)
   deleted: (in p0 l50)
   added: (in p0 a3)
   goals met: 0 of 1
14. (fly-airplane a3 l50 l70 c5 c7)
   deleted: (in a3 l50)
   added: (in a3 l70)
   goals met: 0 of 1
15. (unload-airplane p0 a3 l70 c7)
   deleted: (in p0 a3)
   added: (in p0 l70)
   goals met: 0 of 1
16. (load-truck p0 t7 l70 c7)
   deleted: (in p0 l70)
   added: (in p0 t7)
   goals met: 0 of 1
17. (drive-truck t7 l70 l72 c7)
   deleted: (in t7 l70)
   added: (in t7 l72)
   goals met: 0 of 1
18. (unload-truck p0 t7 l72 c7)
   deleted: (in p0 t7)
   added: (in p0 l72)
   goals met: 1 of 1
